In [4]:
# Import Libry
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder, StandardScaler, MinMaxScaler
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, f1_score

In [5]:
#load data
customer = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/customers.csv')
product = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/products.csv')
transaction_deatil = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/transaction_details.csv')
transaction = pd.read_csv(r'/workspaces/Belajar-Machine-Learning-Dasar/Machine Learning Prediction Iphone Indonesia/clustering.ipynb/data/transactions.csv')

In [6]:
# Melihat data secara keseluruhan dari customer
customer.head(1)

,customer_id,name,email,address,phone_number,age,city,preferred_product_id
0,1,Pranata Natsir,marsudimaryati@example.net,"Gang K.H. Wahid Hasyim No. 2\nProbolinggo, Sul...",(049) 526-4376,28,Medan,4

In [7]:
# Melihat data secara keseluruhan dari product
product.head(1)

,product_id,product_name,category,brand,price,description,discount,storage,color,release_year,years_since_release,sales_factor,preferred_product_id
0,1,iPhone 15,Smartphone,Apple,12000000,Accusantium enim inventore optio eum quam atque.,15,128GB,Black,2023,1,0.9,1

In [8]:
# Melihat data secara keseluruhan dari transaction_detail
transaction_deatil.head(1)

   transaction_id  product_id  quantity  unit_price  discount       total
0           25218          12         3     7000000        15  17850000.0

In [9]:
# Melihat data secara keseluruhan dari transaction
transaction.head(1)

,transaction_id,customer_id,transaction_date,total_amount,payment_method,shipping_method,delivery_time,coupon_code,city,product_id,sales_factor
0,1,506,2023-07-22,11300000.0,Cash on Delivery,Tiki,1 minggu,GRATISONGKIR,Jakarta,12,0.7

In [10]:
customer.head(1)

,customer_id,name,email,address,phone_number,age,city,preferred_product_id
0,1,Pranata Natsir,marsudimaryati@example.net,"Gang K.H. Wahid Hasyim No. 2\nProbolinggo, Sul...",(049) 526-4376,28,Medan,4

In [11]:
# Melihat data yang null
print(customer.isnull().sum())

customer_id             0
name                    0
email                   0
address                 0
phone_number            0
age                     0
city                    0
preferred_product_id    0
dtype: int64

In [12]:
product.isnull().sum()

product_id              0
product_name            0
category                0
brand                   0
price                   0
description             0
discount                0
storage                 0
color                   0
release_year            0
years_since_release     0
sales_factor            0
preferred_product_id    0
dtype: int64

In [13]:
transaction_deatil.isnull().sum()

transaction_id    0
product_id        0
quantity          0
unit_price        0
discount          0
total             0
dtype: int64

In [14]:
transaction.isnull().sum()

transaction_id          0
customer_id             0
transaction_date        0
total_amount            0
payment_method          0
shipping_method         0
delivery_time           0
coupon_code         25044
city                    0
product_id              0
sales_factor            0
dtype: int64

In [15]:
# mengisi nilai null dengan nilai yang sesuai yaitu No
transaction['coupon_code'] = transaction['coupon_code'].fillna('No')

In [16]:
# mengecek kembali data yang null dan melihat hasilnya
transaction.isnull().sum()
transaction.head(1)

,transaction_id,customer_id,transaction_date,total_amount,payment_method,shipping_method,delivery_time,coupon_code,city,product_id,sales_factor
0,1,506,2023-07-22,11300000.0,Cash on Delivery,Tiki,1 minggu,GRATISONGKIR,Jakarta,12,0.7

In [17]:
transaction['shipping_method'].unique()

array(['Tiki', 'JNE', 'GrabExpress', 'POS Indonesia', 'GoSend'],
      dtype=object)

In [18]:
# info data set
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   customer_id           50000 non-null  int64
 1   name                  50000 non-null  object
 2   email                 50000 non-null  object
 3   address               50000 non-null  object
 4   phone_number          50000 non-null  object
 5   age                   50000 non-null  int64
 6   city                  50000 non-null  object
 7   preferred_product_id  50000 non-null  int64
dtypes: int64(3), object(5)
memory usage: 3.1+ MB

In [19]:
customer.head(1)

,customer_id,name,email,address,phone_number,age,city,preferred_product_id
0,1,Pranata Natsir,marsudimaryati@example.net,"Gang K.H. Wahid Hasyim No. 2\nProbolinggo, Sul...",(049) 526-4376,28,Medan,4

In [20]:
# Hapus kolom yang tidak relevan
customer_df = customer.drop(['customer_id', 'name', 'email', 'address', 'phone_number'], axis=1)

# Menampilkan data setelah pembersihan
customer_df.head(5)

   age      city  preferred_product_id
0   28     Medan                     4
1   46     Medan                     4
2   58  Makassar                     2
3   59   Bandung                     9
4   51   Bandung                     3

In [21]:
# Hapus kolom yang tidak relevan
product_df = product.drop([ 'category', 'description', 'brand', 'years_since_release','preferred_product_id','sales_factor'], axis=1)

In [22]:
# Menghapus kolom 'transaction_id' dari dataset
transaction_df = transaction.drop(columns=['transaction_id'])
transaction_df.head()

,customer_id,transaction_date,total_amount,payment_method,shipping_method,delivery_time,coupon_code,city,product_id,sales_factor
0,506,2023-07-22,11300000.0,Cash on Delivery,Tiki,1 minggu,GRATISONGKIR,Jakarta,12,0.7
1,23275,2024-07-01,11053000.0,DANA,Tiki,2-3 hari,SALE20,Bandung,3,0.9
2,24101,2022-11-01,12741000.0,Transfer Bank,JNE,4-5 hari,No,Bandung,5,0.8
3,24188,2022-02-04,4921000.0,OVO,JNE,4-5 hari,SALE20,Yogyakarta,10,0.6
4,33766,2022-02-06,2163000.0,Transfer Bank,GrabExpress,1 minggu,No,Jakarta,11,0.7

In [23]:
product['color'].unique()

array(['Black', 'Blue', 'Silver', 'Gold', 'Red', 'Green', 'Purple',
       'Yellow', 'White', 'Pink', 'Space Gray'], dtype=object)

In [38]:
df = pd.merge(
    customer, 
    transaction,
     
    how='inner',  # 'inner' akan menggabungkan hanya yang memiliki kecocokan
    left_on=['customer_id', 'city', 'preferred_product_id'],  # Kolom yang cocok dari customer_df
    right_on=['customer_id', 'city', 'product_id']  # Kolom yang cocok dari transaction_df
)

# Menampilkan data yang telah digabungkan
df.head()

In [43]:
import pandas as pd

# Misalkan customer, transaction, dan transaction_deatil_df sudah ada

# Gabungkan customer dengan transaction
merged_customer_transaction = pd.merge(
    customer,
    transaction,
    how='inner',  # 'inner' untuk hanya mengambil data yang cocok
    left_on=['customer_id', 'city', 'preferred_product_id'],  # Kolom dari customer
    right_on=['customer_id', 'city', 'product_id']  # Kolom dari transaction
)

# Ganti nama kolom total_amount di merged_customer_transaction untuk menghindari duplikasi
merged_customer_transaction = merged_customer_transaction.rename(columns={'total_amount': 'total_amount_customer'})

# Gabungkan dengan transaction_deatil_df
df = pd.merge(
    merged_customer_transaction, 
    transaction_deatil,
    how='inner',  # 'inner' untuk hanya mengambil data yang cocok
    on=['transaction_id', 'product_id']  # Kolom yang digunakan untuk penggabungan
)

# Tampilkan hasil gabungan
df.head(5)

,customer_id,age,city,preferred_product_id,transaction_id,transaction_date,total_amount_customer,payment_method,shipping_method,delivery_time,coupon_code,product_id,sales_factor,quantity,unit_price,discount,total
0,161,20,Bandung,4,84498,2024-02-05,9095000.0,GoPay,Tiki,1 minggu,No,4,0.9,2,12000000,5,22800000.0
1,163,66,Bandung,3,45025,2024-08-19,16693000.0,Cash on Delivery,GoSend,4-5 hari,No,3,0.9,1,10000000,5,9500000.0
2,220,45,Jakarta,10,43974,2022-07-19,5979000.0,Transfer Bank,GrabExpress,2-3 hari,DISCOUNT10,10,0.6,4,10000000,5,38000000.0
3,248,29,Bandung,6,72969,2024-09-09,2571000.0,Cash on Delivery,JNE,1 minggu,GRATISONGKIR,6,0.8,3,7000000,0,21000000.0
4,255,18,Jakarta,9,91082,2022-04-25,4487000.0,OVO,GrabExpress,4-5 hari,No,9,0.5,4,13000000,0,52000000.0

In [44]:
# Menyimpan DataFrame df ke dalam file CSV dengan nama 'data_cleanen.csv'
df.to_csv('data_cleanen.csv', index=False)

# Konfirmasi bahwa file telah disimpan
print("Data telah disimpan dengan nama 'data_cleanen.csv'.")

Data telah disimpan dengan nama 'data_cleanen.csv'.